In [150]:
import pandas as pd

In [151]:
data = [11,12,13,14,15,16]

In [152]:
series = pd.Series(data , index = ["abc","cde2",3,4,5,6])
print(series)

abc     11
cde2    12
3       13
4       14
5       15
6       16
dtype: int64

In [153]:
series.loc["abc"] = 100

In [154]:
series

abc     100
cde2     12
3        13
4        14
5        15
6        16
dtype: int64

In [155]:
series.iloc[1]

np.int64(12)

In [156]:
series[series<14]

cde2    12
3       13
dtype: int64

In [157]:
calories = { "day 1" : 1222 , "day 2" : 3455 , "day 3" : 1344 }

In [158]:
series = pd.Series(calories)

In [159]:
series

day 1    1222
day 2    3455
day 3    1344
dtype: int64

In [160]:
series.loc["day 2"] = 2500

In [161]:
series

day 1    1222
day 2    2500
day 3    1344
dtype: int64

In [162]:
series.iloc[1] +=200

In [163]:
series

day 1    1222
day 2    2700
day 3    1344
dtype: int64

In [164]:
data = {
    "name" : [ "spongebob" , "patrick" , "squidward"],
    "age" : [ 30,25,35 ]
    }

In [165]:
df = pd.DataFrame(data , index = ["employe 1" , "employe 2" , "employe 3"])
df

                name  age
employe 1  spongebob   30
employe 2    patrick   25
employe 3  squidward   35

In [166]:
df.loc["employe 1"]

name    spongebob
age            30
Name: employe 1, dtype: object

In [167]:
# add a new column 
df["job"] = ["cook" , "N/A" , "cashier"]

In [168]:
df

                name  age      job
employe 1  spongebob   30     cook
employe 2    patrick   25      N/A
employe 3  squidward   35  cashier

In [169]:
# add a new row 
new_rows = pd.DataFrame([{"name" : "sandy" , "age" : 45 , "job" : "engineer" }, 
                        { "name" : "mandy" , "age" : 10 , "job" : "doctor" }],
                        index = ["employe 4" , "employe 5 "])

In [170]:
df = pd.concat([df , new_rows])

In [171]:
df

                 name  age       job
employe 1   spongebob   30      cook
employe 2     patrick   25       N/A
employe 3   squidward   35   cashier
employe 4       sandy   45  engineer
employe 5       mandy   10    doctor